[
    {
        "Name": "Faerie Fire",
        "Text": "Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in the area when the spell is cast is also outlined in light if it fails a Dexterity saving throw. For the duration, objects and affected creatures shed dim light in a 10-foot radius.Any attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.",
        "Level": "1",
        "Type": "Concetration B.A"
    },
    {
        "Name": "Sleep",
        "Text": "This spell sends Creatures into a Magical slumber. Roll 5d8, the total is how many Hit Points of Creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current Hit Points (ignoring Unconscious creatures).Starting with the creature that has the lowest current Hit Points, each creature affected by this spell falls Unconscious until the spell ends, the sleeper takes damage, or someone uses an Action to shake or slap the sleeper awake. Subtract each creature's Hit Points from the total before Moving On to the creature with the next lowest Hit Points. A creature's Hit Points must be equal to or less than the remaining total for that creature to be affected.Undead and Creatures immune to being Charmed aren't affected by this spell.At Higher Levels: When you cast this spell using a spell slot of 2nd Level or higher, roll an additional 2d8 for each slot level above 1st. ",
        "Level": "2",
        "Type": "Instant A"
    },
    {
        "Name": "Burning Hands",
        "Text": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.",
        "Level": "1",
        "Type": "Instant V"
    },
    {
        "Name": "Cure Wounds",
        "Text": "A creature you touch regains a number of Hit Points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on Undead or Constructs.",
        "Level": "1",
        "Type": "Instant H"
    },
    {
        "Name": "Magic Missile",
        "Text": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously and you can direct them to hit one creature or several.",
        "Level": "1",
        "Type": "Instant V"
    },
    {
        "Name": "Shield",
        "Text": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from Magic Missile.",
        "Level": "1",
        "Type": "Instant A"
    },
    {
        "Name": "Thunderwave",
        "Text": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect.",
        "Level": "1",
        "Type": "Instant V"
    },
    {
        "Name": "Charm Person",
        "Text": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. ",
        "Level": "1",
        "Type": "Concentration"
    },
    {
        "Name": "Detect Magic",
        "Text": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt. ",
        "Level": "1",
        "Type": "Concentration"
    },
    {
        "Name": "Feather Fall",
        "Text": "Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature. ",
        "Level": "1",
        "Type": "Instant"
    },
    {
        "Name": "Guiding Bolt",
        "Text": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then. ",
        "Level": "1",
        "Type": "Instant"
    },
    {
        "Name": "Mage Armor",
        "Text": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action. ",
        "Level": "1",
        "Type": "8 hours"
    },
    {
        "Name": "Ray of Frost",
        "Text": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn. ",
        "Level": "0",
        "Type": "Instant"
    },
    {
        "Name": "Tiny Hut",
        "Text": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.\nNine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects can’t extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside. Until the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.",
        "Level": 3,
        "Type": "Ritual(1min)"
    }
]