[
    {
        "Name": "Cure Wounds",
        "Text": "A creature you touch regains a number of Hit Points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on Undead or Constructs.",
        "Level": "1",
        "Type": "Instant H"
    },
    {
        "Name": "Thunderwave",
        "Text": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect.",
        "Level": "1",
        "Type": "Instant V"
    },
    {
        "Name": "Charm Person",
        "Text": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. ",
        "Level": "1",
        "Type": "Concentration"
    },
    {
        "Name": "Detect Magic",
        "Text": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt. ",
        "Level": "1",
        "Type": "Concentration"
    },
    {
        "Name": "Feather Fall",
        "Text": "Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature. ",
        "Level": "1",
        "Type": "Instant"
    },
    {
        "Name": "Guiding Bolt",
        "Text": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then. ",
        "Level": "1",
        "Type": "Instant"
    },
    {
        "Name": "Mage Armor",
        "Text": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action. ",
        "Level": "1",
        "Type": "8 hours"
    },
    {
        "Name": "Ray of Frost",
        "Text": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn. ",
        "Level": "0",
        "Type": "Instant"
    }
]